restapi/modules/v1/controllers/UserController.php

    private function _createUser() {
        // 获取参数
        $mobile = Yii::$app->request->getBodyParam('mobile');
        $password = Yii::$app->request->getBodyParam('password');
        if (empty($mobile)) {
            throw new BadRequestHttpException('缺少必需的参数: mobile');
        } else if (empty($password)) {
            throw new BadRequestHttpException('缺少必需的参数: password');
        }
        // 创建新用户并存到数据库
        $model = new User();
        $model->mobile = $mobile;
        $model->setPassword($password);
        $model->avatar_url = Yii::$app->params[Constants::USER_DEFAULT_AVATAR];
        $model->username = 'lazy'.Yii::$app->security->generateRandomString(8); // 随机生成用户名
        if ($model->save() === false) {
---
INSERT INTO `user` (`mobile`, `password_hash`, `avatar_url`, `username`, `created_at`, `updated_at`) VALUES ('18996480894', '$2y$13$aD1XkUPPw4Tl/MPkvngP4.PBLcqAe3MOB18wAYnSbd5YH7hysjjx.', 'http://palmorder-public.stor.sinaapp.com/images/ic_default_avatar.png', 'lazyS_WSD_Wd', 1462261226, 1462261226)