restapi/models/User.php

    public static function findIdentityByAccessToken($token, $type = null) {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `user` WHERE `access_token`='ZHs91oompFr8p3gGJLmqicrZ4fYZGX5N'