restapi/modules/v1/models/LoginForm.php

    public function login() {
        if ($this->validate()) {
            $user = $this->getUser();
            $user->last_ip = Yii::$app->request->userIP;
            $user->last_device_type = Yii::$app->request->headers->get(Constants::HTTP_DEVICE_TYPE);
            $user->last_device_id = Yii::$app->request->headers->get(Constants::HTTP_DEVICE_ID);
            $user->generateAccessToken();
            $user->save();
---
UPDATE `user` SET `access_token`='jX32P2fHneTzoCioXhUTByEGo-zFoWPx', `last_ip`='::1', `last_device_type`='android', `last_device_id`='99000566712916', `updated_at`=1462261320 WHERE `id`=5